openFoamV8/heatedDuct_c_v0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-2.5001 -2.5001  -0.0001)
    (2.5001 -2.5001  -0.0001)
    (2.5001  2.5001  -0.0001)
    (-2.5001  2.5001  -0.0001)
    (-2.5001 -2.5001 15.0001)
    (2.5001 -2.5001 15.0001)
    (2.5001  2.5001 15.0001)
    (-2.5001  2.5001 15.0001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) fluid (25 30 75) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
    name default;
}

boundary
(
);

// ************************************************************************* //
