openFoamV8/heatedDuct_c_v0/constant/heater/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/heater/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    heater_to_metal
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          1280;
        startFace       5597;
        sampleMode      nearestPatchFace;
        sampleRegion    metal;
        samplePatch     metal_to_heater;
    }
)

// ************************************************************************* //
