openFoamV8/heatedDuct_c_v0/constant/metal/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/metal/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    metalInlet
    {
        type            patch;
        nFaces          642;
        startFace       97683;
    }
    metalOutlet
    {
        type            patch;
        nFaces          642;
        startFace       98325;
    }
    metalExternal
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5500;
        startFace       98967;
    }
    metal_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          2100;
        startFace       104467;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_metal;
    }
    metal_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          1280;
        startFace       106567;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_metal;
    }
)

// ************************************************************************* //
