openFoamV8/heatedDuct_c_v0/constant/heater/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    energySource
    {
        type            semiImplicitSource;

        timeStart       0;
        duration        1e6;
        selectionMode   all;
        volumeMode      specific;

        sources
        {
            e
            {
                explicit    1e8; // W/m^3 == kg/m/s^3
                implicit    0;
            }
        }
    }
}

// ************************************************************************* //
