openFoamV8/heatedDuct_c_v0/0/metal/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/metal";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    metalInlet
    {
        type            calculated;
        value           uniform 0;
    }
    metalOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    metalExternal
    {
        type            calculated;
        value           uniform 0;
    }
    metal_to_fluid
    {
        type            calculated;
        value           uniform 0;
    }
    metal_to_heater
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
